# Dataframes in Pandas

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

type(df)

pandas.core.frame.DataFrame

In [3]:
df

Empty DataFrame
Columns: []
Index: []

Create dataframe from List

In [4]:
lst = [23, 21, 24, 27]

df = pd.DataFrame(lst)

df

    0
0  23
1  21
2  24
3  27

Create dataframe from list of Lists

In [5]:
lst_of_lsts = [['car', 4], ['bike', 2]]

vehicle_df = pd.DataFrame(lst_of_lsts)

vehicle_df

      0  1
0   car  4
1  bike  2

In [6]:
lst_of_lsts = [['car', 4], ['bike', 2]]

vehicle_df = pd.DataFrame(lst_of_lsts, columns=['type', 'wheels']) # adding column names

vehicle_df

   type  wheels
0   car       4
1  bike       2

Create dataframe from dictionaries

In [7]:
vehicle_dict = {'vehicle_type':['car', 'bike', 'auto rickshaw', 'trucks'],
            'wheels': [4, 2, 3, 6]}

vehicle_df = pd.DataFrame(vehicle_dict)

vehicle_df

    vehicle_type  wheels
0            car       4
1           bike       2
2  auto rickshaw       3
3         trucks       6

Access data from Dataframe

In [8]:
vehicle_df['vehicle_type']

0              car
1             bike
2    auto rickshaw
3           trucks
Name: vehicle_type, dtype: object

In [9]:
vehicle_df.loc[1] # loc takes index as argument

vehicle_type    bike
wheels             2
Name: 1, dtype: object

In [10]:
vehicle_df[1:2] # Slicing is possible

  vehicle_type  wheels
1         bike       2

In [11]:
vehicle_df[vehicle_df['wheels']>2] #Conditional data extraction

    vehicle_type  wheels
0            car       4
2  auto rickshaw       3
3         trucks       6

Important variables & methods of dataframe

In [12]:
vehicle_df.shape

(4, 2)

In [13]:
vehicle_df.dtypes

vehicle_type    object
wheels           int64
dtype: object

In [14]:
vehicle_df.head(2) # display first two entries

  vehicle_type  wheels
0          car       4
1         bike       2

In [15]:
temp_dict = {
    'Dates':['2023-12-23', '2023-12-24', '2023-12-25'],
    'Temp (in C)': [17, 18, 19]
}

df = pd.DataFrame(temp_dict)

df

        Dates  Temp (in C)
0  2023-12-23           17
1  2023-12-24           18
2  2023-12-25           19

In [16]:
df['Temp (in C)'].std()

1.0

In [17]:
df['Temp (in C)'].mean()

18.0

In [18]:
df['Temp (in C)'].min()

17

In [19]:
df['Temp (in C)'].describe()

count     3.0
mean     18.0
std       1.0
min      17.0
25%      17.5
50%      18.0
75%      18.5
max      19.0
Name: Temp (in C), dtype: float64

In [20]:
df.drop(df[df['Temp (in C)'] == 18].index, inplace=True)

In [21]:
df

        Dates  Temp (in C)
0  2023-12-23           17
2  2023-12-25           19